#ifndef __UTILITIES_NAMESPACE_H__
#define __UTILITIES_NAMESPACE_H__

//==============================================================================================================================================
//	Подключение стандартных библиотек  и макросов
//==============================================================================================================================================
#include <string>
#include <cstdio>

//==============================================================================================================================================
//	Подключение сторонних библиотек  и макросов
//==============================================================================================================================================

//==============================================================================================================================================
//	Определение структуры namespace
//==============================================================================================================================================

namespace utilities_log_namespace {
	extern	bool type_enable;			//	Флаг активизации вывода на экран
	extern bool type_lock;				//	Флаг блокировки вывода на экран
	extern uint8_t type_timer;			//	Флаг вывода временных отметок на экран
	//
	extern bool print_enable;			//	Флаг активизации вывода в log файл
	extern bool print_lock;				//	Флаг блокировки вывода в log файл
	extern uint8_t print_timer;			//	Флаг вывода временных отметок в log файл
	extern std::string logFile;			//	Имя log файла
	extern FILE * logStream;			//	Поток для вывода логов в файл
};


//==============================================================================================================================================
//	Конец файла
//==============================================================================================================================================


#endif //	__UTILITIES_NAMESPACE_H__
