#ifndef __UTILITIES_FILE_H__
#define __UTILITIES_FILE_H__

//==============================================================================================================================================
//	Подключение стандартных библиотек  и макросов
//==============================================================================================================================================
#include <string>
#include <cstdint>

//==============================================================================================================================================
//	Подключение сторонних библиотек  и макросов
//==============================================================================================================================================
#ifdef WINDOWS_COMPILER
	#ifdef UTILITIES_SV_EXPORTS
		#define UTILITIES_SV_API  __declspec(dllexport)
		#define UTILITIES_SV_DATA __declspec(dllexport) extern
	#else
		#define UTILITIES_SV_API  __declspec(dllimport)
		#define UTILITIES_SV_DATA __declspec(dllimport) extern
	#endif
#else
	#define UTILITIES_SV_API 
	#define UTILITIES_SV_DATA extern
#endif

//==============================================================================================================================================
//	Описание функций модуля
//==============================================================================================================================================
//	Секция UTILITIES_FILE
//==============================================================================================================================================
//	Информация о файлах
//----------------------------------------------------------------------------------------------------------------------------------------------
bool FileExist(const char *fname);
bool FileExist(std::string fname);
long FileSize(const char *FileName);
long FileSize(std::string FileName);

//----------------------------------------------------------------------------------------------------------------------------------------------
//	Чтение из файла
//----------------------------------------------------------------------------------------------------------------------------------------------
long MessageFromFile(const char *FileName, char *Message, long Size);
long MessageFromFile(std::string FileName, char *Message, long Size);
long MessageFromFile(const char *FileName, std::string &Message);
long MessageFromFile(std::string FileName, std::string &Message);


//==============================================================================================================================================
//	Конец файла
//==============================================================================================================================================


#endif //	__UTILITIES_FILE_H__
